{
    "scriptGroup.shortPress": "Short Press",
    "scriptGroup.longPress": "Long Press",
    "scriptGroup.gadgetIntervalMs": "Gadget Interval (ms)",
    "scriptGroup.gadgetIntervalDescription": "Automatically use gadgets during movement, enter 0 to disable",
    "scriptGroup.onlyInTeleportRecover": "Only Recover at Teleport Points",
    "scriptGroup.onlyInTeleportRecoverDescription": "Only go to Statue of the Seven to recover when path is at a teleport point",
    "scriptGroup.skipDuring": "Skip During Hours",
    "scriptGroup.skipDuringDescription": "After completing a route, if the time is within the configured hours (range: 0-23), this map tracking task will be skipped. Suitable for continuous execution fallback tasks, such as wanting to AFK overnight and start executing new tasks after 4 AM.",
    "scriptGroup.selectCombatStrategy": "Select Combat Strategy",
    "scriptGroup.forCombat": "Used for combat",
    "scriptGroup.optimizeSkillCd": "Optimize Character Rotation by Skill CD",
    "scriptGroup.optimizeSkillCdDescription": "Based on entered characters or character+CD, decide to skip character's turn when elemental skill CD hasn't ended, optimizing combat flow. Can enter character names or character names with numbers (comma separated), multiple entries separated by semicolons, e.g.: Baizhu;Zhongli,12; If only character name is entered, internal CD check is used (or if number is less than 0), if character name and number, the number is treated as skill CD in seconds.",
    "scriptGroup.autoCombatEndDetection": "Auto Detect Combat End",
    "scriptGroup.autoCombatEndDetectionDescription": "When combat is detected to have ended, automatically stop combat function",
    "scriptGroup.quickCombatEndCheck": "Faster Combat End Check",
    "scriptGroup.quickCombatEndCheckDescription": "Quickly check if combat has ended. During a script cycle, can check at regular intervals (default 5 seconds) or after specific character actions (when each character completes their script cycle).",
    "scriptGroup.quickCombatEndCheckParams": "Faster Combat End Check Parameters",
    "scriptGroup.quickCombatEndCheckParamsDescription": "Parameters for faster combat end checking. Can enter numbers and character names, multiple entries separated by semicolons, e.g.: 5;Baizhu;Zhongli; If number (less than or equal to 0 means no time-based checks, unit is seconds), specifies check interval, if character name, checks after that character's action cycle. End of cycle check remains unchanged.",
    "scriptGroup.combatEndCheckDelay": "Combat End Check Delay",
    "scriptGroup.combatEndCheckDelayDescription": "Delay for checking combat end. Different characters may have different delays after their skills end, default is 1.5 seconds. Can also specify delay for specific characters, unspecified characters use the default value. Format: 2.5;Baizhu,1.5;Zhongli,1.0;",
    "scriptGroup.keyPressCheckDelay": "Key Press Check Delay",
    "scriptGroup.keyPressCheckDelayDescription": "Delay for checking screen color blocks after pressing team switch key, default is 0.45 seconds. If frequent false detections occur, increase this value, e.g. to 0.75. Ensure this delay doesn't actually bring up the team configuration interface.",
    "scriptGroup.autoPickupDrops": "Auto Pickup Drops",
    "scriptGroup.autoPickupDropsDescription": "Try to pick up nearby drops after combat (works best with Kazuha)",
    "scriptGroup.autoPickupDuration": "Auto Pickup Duration",
    "scriptGroup.autoPickupDurationDescription": "Duration in seconds. 0 means don't auto pickup drops.",
    "scriptGroup.executeKazuhaLongEAfterCombat": "Execute Kazuha Long E After Combat",
    "scriptGroup.executeKazuhaLongEAfterCombatDescription": "After combat ends, if Kaedehara Kazuha is present, execute his long hold E skill to help collect materials",
    "scriptGroup.pickupCombatThreshold": "Pickup Combat Threshold",
    "scriptGroup.pickupCombatThresholdDescription": "Pickup combat threshold. When combat count is less than a certain number and combat ends, don't trigger drop pickup and Kazuha pickup configuration. Only effective when not less than 2.",
    "scriptGroup.onlyPickupEliteDrops": "Elite Drops Only Mode",
    "scriptGroup.onlyPickupEliteDropsDescription": "Requires path file support and monster pickup differentiation enabled. Can be viewed through repository tags. Elite monsters can be marked in point's More > Extended Configuration > Monster Tags. Only picks up points marked as elite or legendary. Non-elite auto pickup: drops at feet during combat can be automatically picked up, but won't execute Kazuha pickup and auto pickup logic. Non-elite pickup disabled: drops at feet during combat won't be automatically picked up either.",
    "scriptGroup.kazuhaPickupTeamName": "Kazuha Pickup Team Name",
    "scriptGroup.kazuhaPickupTeamNameDescription": "After combat, if Kazuha is not present, switch to a team with Kazuha (based on Kazuha pickup being enabled and team name being filled, will switch). Suitable when you need an extra person for experience farming, replacing Kazuha's position. Combat strategy should be compatible with both teams in case team switching fails but combat continues.",
    "scriptGroup.scriptRepository": "Script Repository",
    "scriptGroup.openDirectory": "Open Directory",
    "scriptGroup.combatTimeoutSeconds": "Combat Timeout (seconds)",
    "scriptGroup.combatTimeoutDescription": "Automatically stop combat after this time has elapsed",
    "scriptGroup.shellExecutionConfig": "Shell Execution Configuration",
    "scriptGroup.shellExecutionConfigDescription": "Shell commands in this group will use these settings. If disabled, default configuration will be used.",
    "scriptGroup.disableShellTasks": "Disable Shell Tasks",
    "scriptGroup.disableShellTasksDescription": "When enabled, shell tasks will be skipped",
    "scriptGroup.shellExecutionTimeout": "Shell Execution Timeout",
    "scriptGroup.shellExecutionTimeoutDescription": "Maximum time to wait for command to return, in seconds. If time <= 0, doesn't wait and returns immediately.",
    "scriptGroup.hideCommandWindow": "Hide Command Execution Window",
    "scriptGroup.hideCommandWindowDescription": "Recommended to enable, otherwise there will be a large black box.",
    "scriptGroup.logCommandOutput": "Log Command Output",
    "scriptGroup.logCommandOutputDescription": "When enabled, command output will be shown in log. When disabled, output won't be shown. (Only shows when command executes successfully and has output)",
    "scriptGroup.pathingActionConfig": "Map Tracking Action Configuration",
    "scriptGroup.pathingActionConfigDescription": "Map tracking will execute certain actions when reaching target points. Some actions require configuring the position of corresponding characters in the team.",
    "scriptGroup.normalAttackCharacterIndex": "Normal Attack Character Team Position",
    "scriptGroup.normalAttackCharacterIndexDescription": "Generally used for collecting plants that require elemental reactions",
    "scriptGroup.elementalSkillCharacterIndex": "Elemental Skill Character Team Position",
    "scriptGroup.elementalSkillCharacterIndexDescription": "Used for collecting items like Cor Lapis"
}