{
    "metadata":  {
                     "code":  "fr-FR",
                     "displayName":  "French",
                     "nativeName":  "Français",
                     "version":  "1.0.0"
                 },
    "strings":  {
                    "settings.generalFunctionSettings": "Paramètres de fonctions générales",
                    "settings.keyBindingSettings": "Paramètres de liaison des touches",
                    "settings.keyBindingDescription": "Configurez ici les liaisons de touches pour les contrôles en jeu",
                    "settings.enableGlobalKeyMapping": "Activer le mappage global des touches",
                    "settings.enableGlobalKeyMappingDescription": "Appliquer les paramètres de liaison de touches aux scripts externes",
                    "settings.mapTrackingFeatureMatchingMethod": "Méthode de correspondance des fonctionnalités de suivi de carte",
                    "settings.mapTrackingFeatureMatchingMethodDescription": "Affecte toutes les fonctions de suivi de carte, redémarrage nécessaire",
                    "settings.worldMapTeleportSettings": "Paramètres de téléportation de la carte du monde",
                    "settings.worldMapTeleportSettingsDescription": "Configuration des fonctions de téléportation dans le suivi de carte, domaine automatique, etc.",
                    "settings.enableMapZoomDuringMovement": "Activer le zoom de carte pendant le mouvement",
                    "settings.enableMapZoomDuringMovementDescription": "Recommandé d'activer, la désactivation peut causer des erreurs lors de l'exécution de certains scripts",
                    "settings.maxMouseMovementDistance": "Distance maximale de mouvement de la souris",
                    "settings.maxMouseMovementDistanceDescription": "[100-2000] Trop grand peut faire sortir la souris de la fenêtre",
                    "settings.mapZoomOutDistance": "Distance de zoom arrière de la carte",
                    "settings.mapZoomOutDistanceDescription": "[>600] La carte effectuera un zoom arrière lorsque la distance est supérieure à cela pour accélérer la téléportation",
                    "settings.mapZoomInDistance": "Distance de zoom avant de la carte",
                    "settings.mapZoomInDistanceDescription": "[200-600] La carte effectuera un zoom avant lorsque la distance est inférieure à cela pour améliorer la précision du mouvement",
                    "settings.mouseMovementInterval": "Intervalle de mouvement de la souris (ms)",
                    "settings.mouseMovementIntervalDescription": "[2-100] Des valeurs plus basses déplacent la souris plus rapidement, augmentez si le mouvement de la carte cause des saccades",
                    "settings.statueOfTheSeven": "Paramètres des Statues des Sept",
                    "settings.statueOfTheSevenDescription": "Utilisé pour spécifier la statue pour la guérison",
                    "settings.useNearestStatue": "Utiliser la statue la plus proche pour la guérison",
                    "settings.useNearestStatueDescription": "Lorsqu'activé, sélectionne automatiquement la statue la plus proche, ignorant l'emplacement spécifié ci-dessous",
                    "settings.moveAfterTeleportToStatue": "Se déplacer après la téléportation à la statue",
                    "settings.moveAfterTeleportToStatueDescription": "Lorsqu'activé, se déplace automatiquement vers la statue après la téléportation",
                    "settings.statueCountry": "Pays de la statue",
                    "settings.statueCountryDescription": "Sélectionnez le pays où se trouve la statue",
                    "settings.statueRegion": "Région de la statue",
                    "settings.statueRegionDescription": "Sélectionnez la région où se trouve la statue",
                    "settings.healingWaitInterval": "Intervalle d'attente de guérison (secondes)",
                    "settings.showMaskBorder": "Afficher la bordure du masque",
                    "settings.showMaskBorderDescription": "Ligne de bordure violette autour de la fenêtre du jeu",
                    "settings.useMaskSubform": "Lancer le masque en tant que sous-forme de Genshin (Expérimental)",
                    "settings.useMaskSubformDescription": "Le masque peut suivre complètement le mouvement de la fenêtre, mais présente quelques bugs, redémarrage nécessaire",
                    "settings.healingWaitIntervalDescription": "[1.0-30.0] Combien de temps attendre après la téléportation à une statue avant de guérir",
                    "settings.importLocalScriptRepo": "Importer un dépôt de scripts local (format ZIP)",
                    "settings.importLocalScriptRepoDescription": "À utiliser lorsque le dépôt de scripts ne peut pas être mis à jour en ligne",
                    "settings.otherSettings": "Autres paramètres",
                    "settings.otherSettingsDescription": "Configurer d'autres fonctionnalités comme la récupération automatique du focus",
                    "settings.bgiUiLanguage": "Langue de l'interface BGI",
                    "settings.bgiUiLanguageDescription": "Langue de l'interface utilisateur BGI",
                    "settings.autoActivateGameWindow": "Forcer l'activation de la fenêtre de jeu lorsque le focus est perdu",
                    "settings.autoActivateGameWindowDescription": "S'applique aux tâches du planificateur et à certaines tâches indépendantes. Après avoir perdu le focus, activera automatiquement la fenêtre du jeu. Si vous souhaitez quitter la fenêtre du jeu, mettez d'abord la tâche en pause",
                    "settings.autoCollectExpeditions": "Collecte automatique des expéditions pendant la téléportation",
                    "settings.autoCollectExpeditionsDescription": "Dans les tâches de suivi de chemin du planificateur, lors de l'ouverture de la carte du monde pour se téléporter, il vérifiera d'abord s'il y a des expéditions à collecter. Si c'est le cas, il les collectera automatiquement (en utilisant la logique de collecte de récompenses One Dragon). Prend effet après avoir sélectionné la ville de collecte.",
                    "settings.schedulerErrorRestartConfig": "Configuration de redémarrage en cas d'erreur du planificateur",
                    "settings.schedulerErrorRestartConfigDescription": "Lorsque les tâches du planificateur génèrent des erreurs inattendues, après avoir accumulé un certain nombre d'erreurs, BGI redémarrera automatiquement pour restaurer les fonctionnalités.",
                    "settings.errorCount": "Nombre d'erreurs",
                    "settings.errorCountDescription": "Lors de l'exécution des tâches du planificateur, cela compte les échecs dus aux erreurs. Lorsque le compte est atteint, BGI redémarrera.",
                    "settings.restartGameToo": "Redémarrer le jeu aussi",
                    "settings.combatFailureIsError": "Compter l'échec de combat comme une erreur",
                    "settings.incompletePathIsError": "Compter un chemin incomplet comme une erreur",
                    "settings.farmingPlanConfig": "Configuration du plan de farming",
                    "settings.farmingPlanConfigDescription": "Lorsqu'activé, les statistiques quotidiennes de farming (à partir de 4h du matin) seront suivies. Si la limite est dépassée (nécessite la prise en charge du script avec le drapeau de statistiques de farming activé, ou des fichiers de contrôle de répertoire de fichiers de suivi pour enregistrer les données), les tâches de farming suivantes seront ignorées.",
                    "settings.dailyEliteLimit": "Limite quotidienne d'élites",
                    "settings.dailyEliteLimitDescription": "Lorsque le nombre d'ennemis d'élite farmés atteint cette limite, les scripts ciblant les ennemis d'élite seront ignorés.",
                    "settings.dailyMobLimit": "Limite quotidienne d'ennemis communs",
                    "settings.dailyMobLimitDescription": "Lorsque le nombre d'ennemis communs farmés atteint cette limite, les scripts ciblant les ennemis communs seront ignorés.",
                    "settings.useMihoyoData": "Utiliser les données HoYoLAB pour les calculs",
                    "settings.useMihoyoDataDescription": "Utilise les données HoYoLAB (avec un délai d'environ 2-3 heures) pour ajuster les comptages de farming. Étant donné que les cookies HoYoLAB expirent après un certain temps et doivent être actualisés, si des données HoYoLAB existent pour la journée, les limites ci-dessous seront utilisées; sinon, les limites ci-dessus seront utilisées (les valeurs estimées peuvent différer en raison de kills non liés au farming, comme le farming de lignes telluriques).",
                    "settings.mihoyoDailyEliteLimit": "Limite quotidienne d'élites (HoYoLAB)",
                    "settings.mihoyoDailyEliteLimitDescription": "Lorsque le nombre d'ennemis d'élite farmés atteint cette limite (basée sur les données HoYoLAB), les scripts ciblant les ennemis d'élite seront ignorés.",
                    "settings.mihoyoDailyMobLimit": "Limite quotidienne d'ennemis communs (HoYoLAB)",
                    "settings.mihoyoDailyMobLimitDescription": "Lorsque le nombre d'ennemis communs farmés atteint cette limite (basée sur les données HoYoLAB), les scripts ciblant les ennemis communs seront ignorés.",
                    "settings.mihoyoSettings": "Paramètres HoYoLAB",
                    "settings.mihoyoSettingsDescription": "Configurer les informations liées à HoYoLAB comme le cookie",
                    "settings.cookie": "Cookie",
                    "settings.cookieDescription": "Cookie HoYoLAB",
                    "settings.syncCookieWithScheduler": "Synchroniser le cookie avec le journal du planificateur",
                    "settings.syncCookieWithSchedulerDescription": "Lorsqu'activé, le cookie sera synchronisé entre le journal du planificateur et ce paramètre",
                    "settings.viewMap": "Voir la carte (Développeur)",
                    "settings.viewMapDescription": "Voir l'emplacement actuellement détecté",
                    "settings.placeholder": "Espace réservé",
                    "settings.placeholderDescription": "Description de l'espace réservé",
                    "settings.help": "Aide",
                    "settings.versionUpdate": "Mise à jour de version",
                    "settings.versionUpdateDescription": "Vérifier si une nouvelle version du logiciel est disponible",
                    "settings.checkBetaVersion": "Vérifier la dernière version bêta",
                    "settings.betaVersionWarning": "[BÊTA] Très instable, mise à jour à effectuer avec prudence !",
                    "settings.getLatestBetaFromGithub": "Obtenir la dernière version bêta directement depuis Github",
                    "settings.aboutBetterGI": "À propos de BetterGI",
                    "settings.aboutBetterGIDescription": "Voir le projet, la documentation et autres informations",
                    "settings.restartGameTooDescription": "Lors du redémarrage de BGI, redémarrez également le jeu. Cette configuration ne prendra effet que si la configuration de démarrage est activée : Lancer Genshin simultanément et Entrer automatiquement dans le jeu.",
                    "settings.combatFailureIsErrorDescription": "Dans les scripts de farming, le nombre réel de batailles réussies doit être supérieur ou égal au nombre attendu de batailles pour être considéré comme réussi, sinon une exception est levée. Cela peut résoudre des problèmes comme l'échec d'ouverture de la carte pendant le farming, le changement d'équipe, le blocage dans l'interface Z, ou les popups de carte mensuelle qui peuvent causer un gel infini. Cependant, vous devez vous assurer de la force de votre équipe, car il existe une possibilité que des échecs consécutifs de script dus à des résurrections excessives puissent déclencher des redémarrages infinis.",
                    "settings.incompletePathIsErrorDescription": "Une condition plus stricte que l'échec de combat. Lorsqu'elle est cochée, si un fichier de suivi n'est pas entièrement exécuté, cela compte comme un échec. Cette option nécessite une grande stabilité de vos tâches de suivi. Vous pouvez d'abord observer les journaux avec les statistiques d'erreur pour voir s'il y a des drapeaux rouges consécutifs dépassant le nombre d'échecs ; si c'est le cas, il n'est pas recommandé de cocher cette option.",
                    "settings.viewMapButton": "Voir la carte",
                    "settings.configure": "Configurer",
                    "settings.import": "Importer",
                    "settings.checkUpdate": "Vérifier les mises à jour",
                    "settings.visitGithub": "Visiter Github",
                    "settings.view": "Voir"
                }
}
,
                    "pathingConfig.mapTrackingSettings": "Paramètres de suivi de carte (priorité de configuration de haut en bas, problèmes de style d'interface non résolus)",
                    "pathingConfig.teamSwitchSettings": "Paramètres de changement d'équipe (Lorsque le chemin contient des actions ou des objets à collecter correspondants, passe automatiquement à l'équipe correspondante)",
                    "pathingConfig.characterSettings": "Paramètres de personnage (Lorsque plusieurs personnages correspondent aux conditions, la priorité est donnée aux personnages avec des numéros d'équipe plus petits dans le jeu)",
                    "pathingConfig.thenSwitchToTeam": "puis passer à l'équipe",
                    "pathingConfig.thenCharacterExecutes": "puis le personnage exécute",
                    "pathingConfig.delete": "Supprimer",
                    "pathingConfig.addCondition": "+ Ajouter une condition",
                    "pathingConfig.gadgetIntervalTime": "Intervalle d'utilisation des gadgets (ms)",
                    "pathingConfig.gadgetIntervalDescription": "Utiliser automatiquement les gadgets pendant le déplacement, entrez 0 pour désactiver",
                    "pathingConfig.onlyRecoverAtTeleport": "Récupérer uniquement aux points de téléportation",
                    "pathingConfig.onlyRecoverAtTeleportDescription": "Ne se rendre à la Statue des Sept pour récupérer que lorsque le chemin est à un point de téléportation"